export const postsReducer = (
  state = [
    {
      _id: "asfsdc",
      title:
        "محتوای Half-Life و Cyberpunk 2077 در نسخه دایرکتور کات بازی Death Stranding حضور دارد",
      subtitle: "این محتوا پیش از این در نسخه پی‌سی حضور داشتند",
      banner: "",
      postThumbnail: "img3.jpg",
      author: "جواد تاجی",
      rate: "4.3",
      voters: 5,
      comments: [],
      source: "",
      date: "",
      content: [
        { type: "image", url: "img3.jpg" },
        {
          type: "text",
          text: "محتوای بازی‌های Half-Life و Cyberpunk 2077 که پیش از این مختص نسخه پی‌سی Death Stranding بوده است در نسخه دایرکتور کات بازی Death Stranding نیز حضور خواهند داشت.",
        },
        {
          type: "text",
          text: "چند روز گذشته در وبلاگ پلی استیشن محتویات جدید و مورد انتظار نسخه دایرکتور کات بازی Death Stranding مانند مناطق و مراحل داستانی جدید اعلام شد.",
        },
        { type: "image", url: "post1.jpg" },
        {
          type: "text",
          text: "جی بور در همین پست وبلاگ پلی استیشن همچنین عنوان می‎‌کند:",
        },
        {
          type: "text",
          text: "اگرچه هم اکنون نمی‌توانم در مورد ماموریت‌ها و داستان جدید بازی جزئیات زیادی ارائه کنم اما چیزی که می‌توانم تایید کنم این است که تمام محتوای Half-Life و Cyberpunk 2077 که در نسخه پی‌سی Death Stranding معرفی شده بودند، در نسخه دایرکتور کات بازی Death Stranding نیز حضور خواهند داشت.",
        },
        {
          type: "text",
          text: "حضور این محتوای ویژه به خصوص با توجه به اینکه قبلا فقط در نسخه پی‌سی بازی حضور داشته‌اند، قابل توجه است. البته حضور این دو بازی در Death Stranding: Director’s Cut که به صورت انحصاری برای پلی استیشن 5 عرضه خواهد شد، تعجب‌آور نیز خواهد بود. Half-Life از زمان انتشار مجموعه بازی The Orange Box در پلی استیشن حضور نداشته و Cyberpunk 2077 نیز حضور بسیار بحث برانگیزی در این کنسول را تجربه کرده است و هنگام عرضه از استور پلی استیشن حذف شده بود.",
        },
        {
          type: "text",
          text: "محتوایی که از این دو بازی در دسترس بازیکنان Death Stranding: Director’s Cut قرار خواهد گرفت شامل دستکش‌های جاذبه‌ای الهام گرفته شده از بازی Half-Life Alyx، مکعب‌های همراه برای جمع‌آوری و عینک‌ گوردون فریمن می‌شود. همچنین، محتوای Cyberpunk 2077 شامل عینک‌ جانی سیلورهند و بازوی رباتیکی می‌شود که به بازیکنان اجازه می‌دهد موارد موجود در محیط را هک کنند.",
        },
        {
          type: "text",
          text: "Death Stranding: Director’s Cut در تاریخ ۲۴ سپتامبر یا ۲ مهر برای پلی استیشن 5 منتشر خواهد شد. در حال حاضر مشخص نیست که این عنوان برای پی‌سی هم منتشر می‌شود یا خیر.",
        },
      ],
      category: [
        { title: "اخبار و گزارش ها", link: "news-reports" },
        { title: "اخبار و مقالات", link: "news-articles" },
      ],
      tags: [
        { title: "پلی استیشن 5", link: "playstation" },
        { title: "دث استرندینگ", link: "death-stranding" },
      ],
    },
    {
      _id: "adfgafgag",
      title: "این بازی فن‌مید از Batman 1989 شگفت‌انگیز به‌نظر می‌رسد",
      subtitle: "بازی که حسابی برادران وارنر را عصبانی کرد",
      banner: "",
      postThumbnail: "post3.jpg",
      author: "محمدجواد مبین‌زاده",
      rate: "4.3",
      voters: 7,
      comments: [],
      source: "",
      date: "",
      content: [
        { type: "image", url: "post3.jpg" },
        {
          type: "text",
          text: "یکی از هواداران بتمن چند ماه پیش دمویی از یک بازی Batman منتشر کرد که خودش به تنهایی ساخته بود و I Am Batman نام داشت. این بازی بر اساس فیلم بتمن ۱۹۸۹ تیم برتون توسعه یافته و متاسفانه احتمال عرضه آن برای استفاده عمومی تقریبا صفر است.",
        },
        {
          type: "text",
          text: "عثمانی گومز یک هوادار خوش ذوق و بااستعداد از بازی‌های بتمن است که مخاطبان را با دمو بازی I Am Batman شگفت‌زده کرد. با این حال چنین عملی پای مراجع قضایی و کپی رایت را مستقیما وارد کار می‌کند و به همین دلیل، می‌توان مطمئن بود که بازی این هوادار هیچ‌گاه منتشر نخواهد شد.",
        },
        {
          type: "text",
          text: "گومز در ماه می دمو بازی خود را منتشر کرد که بر اساس دنیاهای Batman 1989 و Batman Returns ساخته شده. توسعه‌دهنده بازی به خاطر نگرانی‌های قانونی دموی آن را از دسترس خارج کرده و امکان دانلود و تجربه‌اش برای افراد دیگر وجود ندارد.",
        },
        { type: "image", url: "batman.jpg" },
        {
          type: "text",
          text: "برادران وارنر پس از پخش ویدیوهای دمو بازی‌ فن‌مید‌ Batman‌ چنان خشمگین شد که حتی به ویدیوهای یوتیوب هم رحم نمی‌کرد و آن‌ها را حذف می‌نمود. طبق چیزهایی که در ویدیوها دیده شده I Am Batman با استفاده از موتور آنریل انجین ساخته شده و طراحی آن به شکل عجیبی دقیق و خارق‌العاده است.",
        },
        {
          type: "text",
          text: "همچنین سبک طراحی سه‌گانه Arkham، حالت اول شخص، شخصیت‌های جوکرِ جک نیکلسون و پنگوئنِ دنی دویتو نیز در ویدیو دمو مشاهده می‌شوند. شما می‌توانید از طریق این لینک ویدیو ۲۰ دقیقه‌ای از دمو بازی فن‌مید Batman را در یوتیوب تماشا کنید",
        },
        {
          type: "text",
          text: "نظر شما راجع به بازی I Am Batman چیست؟ شما هم دوست دارید یک روز شاهد عرضه عمومی آن باشید؟",
        },
      ],
      category: [
        { title: "اخبار و گزارش ها", link: "news-reports" },
        { title: "اخبار و مقالات", link: "news-articles" },
      ],
      tags: [
        { title: "بتمن", link: "batman" },
        { title: "برادران وارنر", link: "warner-bros" },
      ],
    },
    {
      _id: "asdgagag",
      title: "Thor: Love & Thunder دیوانه‌وارترین فیلم تایکا وایتیتی خواهد بود",
      subtitle: "انتظار یک فیلم مشابه Ragnarok نداشته باشید",
      banner: "",
      postThumbnail: "post4.jpg",
      author: "رایان زجاجی",
      rate: "5",
      voters: 2,
      comments: [],
      source: "",
      date: "",
      content: [
        { type: "image", url: "post4.jpg" },
        {
          type: "text",
          text: "کارگردان Thor: Love & Thunder یعنی تایکا وایتیتی می‌گوید که این فیلم دیوانه‌وارترین چیزی است که او تاکنون ساخته.",
        },
        {
          type: "text",
          text: "وایتیتی که قبلا فیلم سوم تور یعنی Thor: Ragnarok را کارگردانی کرده بود، اخیرا فیلم‌برداری Thor: Love & Thunder را به اتمام رساند. شاید با خود فکر می‌کنید که فیلم جدید تور هم قرار است از فرمول Ragnarok پیروی کند، اما وایتیتی وعده داده که با داستانی بسیار متفاوت طرف خواهید بود. او در مصاحبه‌ای با مجله Empire گفت:",
        },
        {
          type: "text",
          text: "بین من و شما و خوانندگان باشد، من دیوانه‌بازی‌های زیادی در زندگی‌ام کرده‌ام. من انگار ده بار زندگی کرده‌ام. اما این دیوانه‌وارترین فیلمی است که تاکنون ساخته‌ام. اگر همه المان‌های فیلم را روی کاغذ بنویسید، نباید با عقل جور در بیاید. حتی جوری است که احتمالا اصلا نباید ساخته شود. اگر وارد یک اتاق شوید و بگویید من این و این و این را می‌خواهم، کی با من است؟ این مردم. اسمش را چی می‌گذارید؟ Love and Thunder. بعد از آن دیگر کار گیرتان نمی‌آید. شاید بعد از این دیگر کار نکنم.",
        },
        {
          type: "text",
          text: "وایتیتی همچنین گفته که این فیلم قرار است تمرکز بیشتری روی احساسات، عشق، و انرژی داشته باشد",
        },
      ],
      category: [
        { title: "اخبار و گزارش ها", link: "news-reports" },
        { title: "اخبار و مقالات", link: "news-articles" },
      ],
      tags: [
        { title: "ثور", link: "thor" },
        { title: "دنیای سینمایی مارول", link: "marvel" },
        { title: "مارول", link: "marvel" },
      ],
    },
    {
      _id: "sdlkgjslgjklsjg;lsjg",
      title: "بررسی عملکرد ویندوز 11 برای گیمینگ",
      subtitle:
        "همان طور که گفته می‌شود بایستی انتظار بهترین نسخه ویندوز برای گیمینگ را کشید؟",
      banner: "post2.jpg",
      postThumbnail: "post2.jpg",
      author: "شیرین منظری",
      rate: "4.3",
      voters: 6,
      comments: [],
      source: "",
      date: "",
      content: [
        { type: "title", text: "مقدمه" },
        {
          type: "text",
          text: "چندی پیش و در قالب یک رویداد آنلاین به نام «What’s Next for Windows»، ماکروسافت رسما از نسخه جدید ویندوز رونمایی کرد. این رونمایی با توجه به گفته پیشین این کمپانی مبنی بر آخرین نسخه ویندوز 10، تعجب بسیاری از مخاطبین را برانگیخت.",
        },
        { type: "image", url: "windows11.jpg" },
        {
          type: "text",
          text: "مایکروسافت پیش‌تر و در سال ۲۰۱۵ و پس از معرفی ویندوز 10 عنوان کرده بود که این آخرین نسخه ویندوز خواهد بود. و من بعد هر نوع تغییراتی به صورت رایگان و از طریق آپدیت‌های دوره‌ای اعمال خواهد شد. اما در کمال تعجب نسخه بعدی ویندوز با نام ویندوز 11 قرار است در تعطیلات سال جاری میلادی راهی بازار شود. هرچند گفته می‌شود که این نسخه در قالب یک آپدیت رایگان در اختیار خریداران ویندوز 10 قرار خواهد گرفت.",
        },
        {
          type: "text",
          text: "اتفاقات اخیر و در دنبال‌ی آن عرضه‌ی نسخه غیر رسمی ویندوز 11 حواشی زیادی برای مایکروسافت ایجاد کرده است که بررسی آن از حوصله این مقاله خارج است. اما گیمینگ و تغییرات جدید ویندوز در نسخه جدید همان چیزی است که همه ما برای آن هیجان زده هستیم.",
        },
      ],
      category: [
        { title: "اخبار و مقالات", link: "news-articles" },
        { title: "مقالات", link: "articles" },
      ],
      tags: [
        { title: "پی سی گیمینگ", link: "pc-gaming" },
        { title: "گیمینگ", link: "gaming" },
        { title: "ویندوز", link: "windows" },
      ],
    },
    {
      _id: "sdjslkjlskjglksjdfg",
      title: "بازی Final Fantasy 16 در رویداد توکیو گیم شو حضور ندارد",
      subtitle: "گرچه روند توسعه همچنان خوب پیش می‌رود",
      banner: "",
      postThumbnail: "post5.jpg",
      author: "محمدجواد مبین‌زاده",
      rate: "5",
      comments: [],
      source: "PC Gamer",
      date: "",
      content: [
        { type: "image", url: "post5.jpg" },
        {
          type: "text",
          text: "نائوکی یوشیدا به تازگی طی یک استریم مفصل با محوریت فاینال فانتزی ۱۴ حضور پیدا کرد و صحبت‌هایی راجع به بازی مورد انتظار Final Fantasy 16 انجام داد. گرچه کلیت حرف‌ها به این خلاصه می‌شد که بازی مذکور متاسفانه در رویداد توکیو گیم شو که جایی در سپتامبر یا اکتبر برگزار می‌شود هم حضور نخواهد داشت.",
        },
        {
          type: "text",
          text: "با این حال ظاهرا روند کلی توسعه بازی با سرعت خیلی خوبی پیش می‌رود و علاوه بر نوشتن تمامی سناریوها، ضبط صدای انگلیسی شخصیت‌ها نیز تقریبا به پایان رسیده است. دلیل اصلی عدم حضور فاینال فانتزی ۱۶ در رویداد توکیو گیم شو احتمالا ایده‌آل‌گرایی توسعه دهندگان و عدم نمایش آن پیش از آمادگی برای عرضه باشد.",
        },
        {
          type: "text",
          text: "یوشیدا اشاره کرده که در بروزرسانی بعدی مربوط به بازی Final Fantasy 16 توسعه‌دهندگان به سیستم مبارزه و چیزهایی خواهند پرداخت که تاکنون هیچ جزییاتی درباره‌شان نشنیده‌ایم. گرچه مشخص است که تا این بروزرسانی جدید زمان زیادی باقی مانده است.",
        },
        { type: "image", url: "final-fantacy.jpg" },
        {
          type: "text",
          text: "چند ماه پیش گزارشی منتشر شد که می‌گفت اسکوئر انیکس از عمد اخبار زیادی از نسخه شانزدهم فاینال فانتزی نمی‌کند. طبق صحبت‌های سازندگان، کمبود اطلاعات و آپدیت‌های نسخه شانزدهم جزو برنامه‌های اصلی توسعه‌دهندگان است تا هایپ و انتظار خاصی ایجاد نشود:",
        },
        {
          type: "text",
          text: "ما نمی‌خواهیم راجع به چیزی که نصفه و نیمه است صحبت بکنیم و انتظار بی‌دلیل ایجاد نماییم. در هر حال شما ممکن است طرفدار یک نسخه خاص از فاینال فانتزی باشید و بسته به آن نسبت به المان‌های خاصی هیجان‌زده شوید.",
        },
      ],
      category: [
        { title: "اخبار و گزارش ها", link: "news-reports" },
        { title: "اخبار و مقالات", link: "news-articles" },
      ],
      tags: [
        { title: "اسکوئر انیکس", link: "square-enix" },
        { title: "فاینال فانتزی", link: "final-fantasy" },
      ],
    },
    {
      _id: "adaghefcvhryjsfg",
      title: "GTA 6 یا Elder Scrolls 6؛ کدام یک زودتر عرضه می‌شوند؟",
      subtitle: "نسخه ششم کدام بازی زودتر می‌آید؟",
      banner: "post6.jpg",
      postThumbnail: "post6.jpg",
      author: "محمد سرپناه",
      rate: "5",
      voters: 20,
      comments: [
        {
          author: "Poria-sk",
          text: "جواب : هیچ کدوم بتسدا و راکستار مسابقه گداشتن هر کدوم نسخه جدید رو بده میبازه ,🤣🤣🤣🤣🤣🤣🤣🤣🤣😂😂😂😂😂",
          like: 2,
          dislike: 0,
          avatar: "avatar.jpg",
        },
        {
          author: "Amin-80",
          text: "GTA 6 سال ۲۰۲۶ عرضه بشه ، هفتش هم سال ۲۰۳۷ عرضه میشه ، اگه هم این اتفاق نیوفتاد بعد از ریاست جمهوری هشت ساله رئیسی هم از GTA 6 خبری نیست 😂😂😂",
          like: 2,
          dislike: 1,
          avatar: "avatar2.jpg",
        },
        {
          author: "cr7-fan",
          text: "امیدوارم استارفیلد بتونه انتظارات رو برآورده کنه",
          like: 4,
          dislike: 1,
          avatar: "avatar3.jpg",
        },
        {
          author: "Daeealireza",
          text: "میو",
          like: 3,
          dislike: 1,
          avatar: "avatar4.jpg",
        },
      ],
      source: "PC Gamer",
      date: "",
      content: [
        { type: "image", url: "gta.jpg" },
        {
          type: "text",
          text: "اوایل همین هفته یکی از لیکرهای معتبر به نام تام هندرسون با انتشار ویدئویی در یوتوب از اطلاعاتی که راجع به GTA 6 می‌داند صحبت کرد. هندرسون در خلال صحبت‌هایش در مورد موارد گوناگون موجود در بازی، اذعان داشت که نمی‌توان انتظار داشت بازی تا سال‌های ۲۰۲۴ یا ۲۰۲۵ عرضه شود.",
        },
        {
          type: "text",
          text: "با کمال تاسف به نظر می‌رسد اطلاعات پیرامون بازی با جدول زمانی آن مطابقت داشته باشند. هنوز چیز زیادی راجع به توسعه GTA 6 نمی‌دانیم، اما به نظر می‌رسد راکستار فعلا می‌خواهد زمان خود را بازی‌های فعلیش بگذراند. پس از حرف و حدیث‌هایی هم که راجع به کرانچ کارکنان در زمان عرضه Red Dead Redemption II به وجود آمد راکستار تلاش کرده تا تغییراتی در فرهنگ شرکت خود و به خصوص مسئله کرانچ به وجود بیاورد.",
        },
        {
          type: "text",
          text: "این‌ها اگر منتج به طولانی شدن ساخت بازی هم شوند در نهایت حرکت رو به جلو و مثبتی هستند چرا که فکر نمی‌‎کنم هیچ کدام از گیمرها راضی باشند تا سازندگان بازی برای ساخت بازی دلخواهشان به بیماری و بی‌خوابی و بیگاری دچار شوند! البته باید توجه داشت کرانچ نکردن عموما به معنای طولانی شدن زمان ساخت اثر نیست.",
        },
        {
          type: "text",
          text: "دلیل دیگری که به نظر می‌رسد عرضه بازی در اواسط دهه ۲۰ را تایید می‌کند، کمبود کنسول‌های تازه به میدان آمده هستند. برکسی پوشیده نیست که به دست آوردن PS5 و Xbox Series X/S و کارت گرافیک کامپیوترهای شختصی در هر جایی از دنیا بخاطر کمبود آن‌ها، سخت شده است. به همین خاطر، دلیلی ندارد که راکستار بخواهد بازی‌اش را برای کنسولی که هنوز هواداران دستشان به آن نرسیده بازاریابی کند.",
        },
      ],
      category: [
        { title: "اخبار و مقالات", link: "news-articles" },
        { title: "مقالات", link: "articles" },
      ],
      tags: [
        { title: "GTA", link: "GTA" },
        { title: "بتسدا", link: "brthesda" },
        { title: "راکستار", link: "rockstar" },
      ],
    },
    {
      _id: "adaghefdsfdsfsdfcvhryjsfg",
      title: "چرا Dino Crisis به اندازه Resident Evil محبوب نشد؟",
      subtitle: "یادآوری عنوانی که 18 سال است به خواب عمیقی فرو رفته",
      banner: "dino.jpg",
      postThumbnail: "dino.jpg",
      author: "محمد سرپناه",
      rate: "5",
      voters: 12,
      comments: [],
      source: "gamerant",
      date: "",
      content: [
        {
          type: "text",
          text: "طی چند سال گذشته کپکام در ساخت ریمیک‌های عناوین مختلفش بسیار عالی عمل کرده، به خصوص آن‌هایی که از فرانچایز رزیدنت ایول بوده‌اند. البته جای تعجب هم ندارد چرا که رزیدنت ایول بزرگترین فرانچایز این شرکت محبوب ژاپنی محسوب می‌شود. با این حال اما بسیار از هواداران درخواست ساخت ریمیک بازی‌های دیگری هم از کپکام کرده‌اند. فرانچایز Dino Crisis که نزدیک به ۲ دهه است فراموش شده، یکی از همان بازی‌هاست.",
        },
        {
          type: "text",
          text: "Dino Crisis در همان سال عرضه‌اش (سال ۱۹۹۹) توانست توجع بسیاری از فن‌های ژانر وحشت و بقا را به خود جلب کند. خصوصا به دلیل آن که بازی پس از عرضه رزیدنت ایول ۱ و موفقیت عظیمش عرضه می‌شد. در آن زمان ایده بسیاری از مردم این بود که کپکام می‌تواند موفقیت خود با رزیدنت ایول را در فرانچایز جدیدی تکرار کند. اما فن‌های بازی با عرضه نسخه سوم رزیدنت ایول خیلی زود علاقه خود را به Dino Crisis از دست دادند. اما سوال اینجاست بازی مشابه رزیدنت ایول که در آن دایناسورها حضور بسیار پررنگی داشتند، چرا موفق به تکرار فرانچایز رزیدنت ایول نشد؟",
        },
      ],
      category: [
        { title: "اخبار و مقالات", link: "news-articles" },
        { title: "مقالات", link: "articles" },
      ],
      tags: [
        { title: "رزیدنت لویل", link: "resident-evil" },
        { title: "کپکام", link: "capcom" },
      ],
    },
  ],
  action
) => {
  switch (action.type) {
    case "SET_POSTS":
      return [...action.payload];
    case "CLEAR_POSTS":
      return [...action.payload];
    default:
      return state;
  }
};
