export const topNewPostsReducer = (
  state = [
    {
      _id: "sdlkgjslgjklsjg;lsjg",
      title: "بررسی عملکرد ویندوز 11 برای گیمینگ",
      subtitle:
        "همان طور که گفته می‌شود بایستی انتظار بهترین نسخه ویندوز برای گیمینگ را کشید؟",
      banner: "post2.jpg",
      postThumbnail: "post2.jpg",
      author: "شیرین منظری",
      rate: "4.3",
      voters: 6,
      comments: [],
      source: "",
      date: "",
      content: [
        { type: "title", text: "مقدمه" },
        {
          type: "text",
          text: "چندی پیش و در قالب یک رویداد آنلاین به نام «What’s Next for Windows»، ماکروسافت رسما از نسخه جدید ویندوز رونمایی کرد. این رونمایی با توجه به گفته پیشین این کمپانی مبنی بر آخرین نسخه ویندوز 10، تعجب بسیاری از مخاطبین را برانگیخت.",
        },
        { type: "image", url: "windows11.jpg" },
        {
          type: "text",
          text: "مایکروسافت پیش‌تر و در سال ۲۰۱۵ و پس از معرفی ویندوز 10 عنوان کرده بود که این آخرین نسخه ویندوز خواهد بود. و من بعد هر نوع تغییراتی به صورت رایگان و از طریق آپدیت‌های دوره‌ای اعمال خواهد شد. اما در کمال تعجب نسخه بعدی ویندوز با نام ویندوز 11 قرار است در تعطیلات سال جاری میلادی راهی بازار شود. هرچند گفته می‌شود که این نسخه در قالب یک آپدیت رایگان در اختیار خریداران ویندوز 10 قرار خواهد گرفت.",
        },
        {
          type: "text",
          text: "اتفاقات اخیر و در دنبال‌ی آن عرضه‌ی نسخه غیر رسمی ویندوز 11 حواشی زیادی برای مایکروسافت ایجاد کرده است که بررسی آن از حوصله این مقاله خارج است. اما گیمینگ و تغییرات جدید ویندوز در نسخه جدید همان چیزی است که همه ما برای آن هیجان زده هستیم.",
        },
      ],
      category: [
        { title: "اخبار و مقالات", link: "news-articles" },
        { title: "مقالات", link: "articles" },
      ],
      tags: [
        { title: "پی سی گیمینگ", link: "pc-gaming" },
        { title: "گیمینگ", link: "gaming" },
        { title: "ویندوز", link: "windows" },
      ],
    },
    {
      _id: "adaghefcvhryjsfg",
      title: "GTA 6 یا Elder Scrolls 6؛ کدام یک زودتر عرضه می‌شوند؟",
      subtitle: "نسخه ششم کدام بازی زودتر می‌آید؟",
      banner: "post6.jpg",
      postThumbnail: "post6.jpg",
      author: "محمد سرپناه",
      rate: "5",
      voters: 20,
      comments: [
        {
          author: "Poria-sk",
          text: "جواب : هیچ کدوم بتسدا و راکستار مسابقه گداشتن هر کدوم نسخه جدید رو بده میبازه ,🤣🤣🤣🤣🤣🤣🤣🤣🤣😂😂😂😂😂",
          like: 2,
          dislike: 0,
          avatar: "avatar.jpg",
        },
        {
          author: "Amin-80",
          text: "GTA 6 سال ۲۰۲۶ عرضه بشه ، هفتش هم سال ۲۰۳۷ عرضه میشه ، اگه هم این اتفاق نیوفتاد بعد از ریاست جمهوری هشت ساله رئیسی هم از GTA 6 خبری نیست 😂😂😂",
          like: 2,
          dislike: 1,
          avatar: "avatar2.jpg",
        },
        {
          author: "cr7-fan",
          text: "امیدوارم استارفیلد بتونه انتظارات رو برآورده کنه",
          like: 4,
          dislike: 1,
          avatar: "avatar3.jpg",
        },
        {
          author: "Daeealireza",
          text: "میو",
          like: 3,
          dislike: 1,
          avatar: "avatar4.jpg",
        },
      ],
      source: "PC Gamer",
      date: "",
      content: [
        { type: "image", url: "gta.jpg" },
        {
          type: "text",
          text: "اوایل همین هفته یکی از لیکرهای معتبر به نام تام هندرسون با انتشار ویدئویی در یوتوب از اطلاعاتی که راجع به GTA 6 می‌داند صحبت کرد. هندرسون در خلال صحبت‌هایش در مورد موارد گوناگون موجود در بازی، اذعان داشت که نمی‌توان انتظار داشت بازی تا سال‌های ۲۰۲۴ یا ۲۰۲۵ عرضه شود.",
        },
        {
          type: "text",
          text: "با کمال تاسف به نظر می‌رسد اطلاعات پیرامون بازی با جدول زمانی آن مطابقت داشته باشند. هنوز چیز زیادی راجع به توسعه GTA 6 نمی‌دانیم، اما به نظر می‌رسد راکستار فعلا می‌خواهد زمان خود را بازی‌های فعلیش بگذراند. پس از حرف و حدیث‌هایی هم که راجع به کرانچ کارکنان در زمان عرضه Red Dead Redemption II به وجود آمد راکستار تلاش کرده تا تغییراتی در فرهنگ شرکت خود و به خصوص مسئله کرانچ به وجود بیاورد.",
        },
        {
          type: "text",
          text: "این‌ها اگر منتج به طولانی شدن ساخت بازی هم شوند در نهایت حرکت رو به جلو و مثبتی هستند چرا که فکر نمی‌‎کنم هیچ کدام از گیمرها راضی باشند تا سازندگان بازی برای ساخت بازی دلخواهشان به بیماری و بی‌خوابی و بیگاری دچار شوند! البته باید توجه داشت کرانچ نکردن عموما به معنای طولانی شدن زمان ساخت اثر نیست.",
        },
        {
          type: "text",
          text: "دلیل دیگری که به نظر می‌رسد عرضه بازی در اواسط دهه ۲۰ را تایید می‌کند، کمبود کنسول‌های تازه به میدان آمده هستند. برکسی پوشیده نیست که به دست آوردن PS5 و Xbox Series X/S و کارت گرافیک کامپیوترهای شختصی در هر جایی از دنیا بخاطر کمبود آن‌ها، سخت شده است. به همین خاطر، دلیلی ندارد که راکستار بخواهد بازی‌اش را برای کنسولی که هنوز هواداران دستشان به آن نرسیده بازاریابی کند.",
        },
      ],
      category: [
        { title: "اخبار و مقالات", link: "news-articles" },
        { title: "مقالات", link: "articles" },
      ],
      tags: [
        { title: "GTA", link: "GTA" },
        { title: "بتسدا", link: "brthesda" },
        { title: "راکستار", link: "rockstar" },
      ],
    },
    {
      _id: "adaghefdsfdsfsdfcvhryjsfg",
      title: "چرا Dino Crisis به اندازه Resident Evil محبوب نشد؟",
      subtitle: "یادآوری عنوانی که 18 سال است به خواب عمیقی فرو رفته",
      banner: "dino.jpg",
      postThumbnail: "post6.jpg",
      author: "محمد سرپناه",
      rate: "5",
      voters: 12,
      comments: [],
      source: "gamerant",
      date: "",
      content: [
        {
          type: "text",
          text: "طی چند سال گذشته کپکام در ساخت ریمیک‌های عناوین مختلفش بسیار عالی عمل کرده، به خصوص آن‌هایی که از فرانچایز رزیدنت ایول بوده‌اند. البته جای تعجب هم ندارد چرا که رزیدنت ایول بزرگترین فرانچایز این شرکت محبوب ژاپنی محسوب می‌شود. با این حال اما بسیار از هواداران درخواست ساخت ریمیک بازی‌های دیگری هم از کپکام کرده‌اند. فرانچایز Dino Crisis که نزدیک به ۲ دهه است فراموش شده، یکی از همان بازی‌هاست.",
        },
        {
          type: "text",
          text: "Dino Crisis در همان سال عرضه‌اش (سال ۱۹۹۹) توانست توجع بسیاری از فن‌های ژانر وحشت و بقا را به خود جلب کند. خصوصا به دلیل آن که بازی پس از عرضه رزیدنت ایول ۱ و موفقیت عظیمش عرضه می‌شد. در آن زمان ایده بسیاری از مردم این بود که کپکام می‌تواند موفقیت خود با رزیدنت ایول را در فرانچایز جدیدی تکرار کند. اما فن‌های بازی با عرضه نسخه سوم رزیدنت ایول خیلی زود علاقه خود را به Dino Crisis از دست دادند. اما سوال اینجاست بازی مشابه رزیدنت ایول که در آن دایناسورها حضور بسیار پررنگی داشتند، چرا موفق به تکرار فرانچایز رزیدنت ایول نشد؟",
        },
      ],
      category: [
        { title: "اخبار و مقالات", link: "news-articles" },
        { title: "مقالات", link: "articles" },
      ],
      tags: [
        { title: "رزیدنت لویل", link: "resident-evil" },
        { title: "کپکام", link: "capcom" },
      ],
    },
  ],
  action
) => {
  switch (action.type) {
    case "SET_TOPNEWPOSTS":
      return [...action.payload];
    case "CLEAR_TOPNEWPOSTS":
      return [...action.payload];
    default:
      return state;
  }
};
